---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussIsAttachedTo
source: html/3664190b-2c58-dbf7-51a9-39bdb5d9afcd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussIsAttachedTo Property

Revit cannot attach to the chosen Roof/Slab. The truss cannot project to a surface or the attachment creates an invalid profile.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussIsAttachedTo { get; }
```